
==============================
Basic call
==============================

print("hello world")

---

(program (function_call (called_object (identifier)) (string)))

==============================
Basic single string arg
==============================

print "hello world"

---

(program (function_call (called_object (identifier)) (string)))

==============================
Basic single table arg
==============================

print {}

---

(program (function_call (called_object (identifier)) (table_constructor)))

==============================
Call table entry
==============================

foo.bar()

---

(program (function_call (called_object (identifier) (identifier))))

==============================
Higher order calls
==============================

func_that_returns_func()()

---

(program (function_call (called_object (function_call (called_object (identifier))))))

==============================
More higher order calls
==============================

func_that_returns_func()()()()()()()

---

(program
  (function_call (called_object
    (function_call (called_object
      (function_call (called_object
        (function_call (called_object
          (function_call (called_object
            (function_call (called_object
              (function_call (called_object (identifier))))))))))))))))

==============================
Even more higher order calls
==============================

func_that_returns_func "hello" "world" "foo" "bar"

---

(program
  (function_call (called_object
    (function_call (called_object
      (function_call (called_object
        (function_call (called_object (identifier))
          (string)))
            (string)))
              (string)))
                (string)))

==============================
You get the idea
==============================

func_that_returns_func "hello" { this = "is" } "getting" "silly"

---

(program
  (function_call (called_object
    (function_call (called_object
      (function_call (called_object
        (function_call (called_object (identifier)) (string)))
          (table_constructor
            table_key: (identifier) (string)))) (string))) (string)))
